app/controllers/business_units_controller.rb

SELECT "business_units".* FROM "business_units"
---
  def index
    @business_units = BusinessUnit.all

SELECT "dealers".* FROM "dealers"
---
  def new
    @business_unit = BusinessUnit.new
    @BU_options = Dealer.all.map { |u| [u.name, u.id]  }

SELECT "dealers".* FROM "dealers"
---
  def edit
    @BU_options = Dealer.all.map { |u| [u.name, u.id]  }

INSERT INTO "business_units" ("short_name", "long_name", "status", "address", "phone", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @business_unit = BusinessUnit.new(business_unit_params)

    respond_to do |format|
      if @business_unit.save

UPDATE "business_units" SET "creation_date" = ?, "updated_at" = ? WHERE "business_units"."id" = ?  [["creation_date", "2012-02-12"], ["updated_at", "2015-03-07 10:40:27.682923"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @business_unit.update(business_unit_params)

SELECT  "business_units".* FROM "business_units" WHERE "business_units"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_business_unit
      @business_unit = BusinessUnit.find(params[:id])