app/controllers/dealers_controller.rb

SELECT "dealers".* FROM "dealers"
---
  def index
    @dealers = Dealer.all

SELECT "main_entities".* FROM "main_entities"
---
  def new
    @dealer = Dealer.new
    @entities_options = MainEntity.all.map { |u| [u.name, u.id]  }

SELECT "main_entities".* FROM "main_entities"
---
  def edit
      @entities_options = MainEntity.all.map { |u| [u.name, u.id]  }

INSERT INTO "dealers" ("name", "main_name", "creation_date", "status", "address", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @dealer = Dealer.new(dealer_params)

    respond_to do |format|
      if @dealer.save

SELECT  "dealers".* FROM "dealers" WHERE "dealers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_dealer
      @dealer = Dealer.find(params[:id])