app/controllers/main_entities_controller.rb

  def index
    @main_entities = MainEntity.all
---
SELECT "main_entities".* FROM "main_entities"

  def create
    @main_entity = MainEntity.new(main_entity_params)

    respond_to do |format|
      if @main_entity.save
---
INSERT INTO "main_entities" ("name", "main_name", "creation_date", "status", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_main_entity
      @main_entity = MainEntity.find(params[:id])
---
SELECT  "main_entities".* FROM "main_entities" WHERE "main_entities"."id" = ? LIMIT 1  [["id", 1]]